app/controllers/application_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses"
---
  def specific_class
    @course = Course.find(params[:id])
    all_prereqs = @course.compute_prereqs_given_user(@user)
    @remaining_prereqs = all_prereqs[0]
    @finished_prereqs = all_prereqs[1]

    @professorCourses = ProfessorCourse.where(number: @course.number)
    @professors = Set.new
    @professorCourses.each do |professorCourse|

INSERT INTO "users" ("first_name", "last_name", "email", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1067193"]]
SELECT  "user_courses".* FROM "user_courses" WHERE "user_courses"."user_id" = ? AND "user_courses"."title" = ? LIMIT 1  [["user_id", 2], ["title", "Title3"]]
INSERT INTO "courses" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "CS61A: The Structure & Interpretation of Computer Programs"], ["user_id", 21], ["created_at", "2016-03-01 19:02:03.843110"], ["updated_at", "2016-03-01 19:02:03.843110"]]
---
  def create
    @user = User.create(first_name: params[:first_name],
                        last_name: params[:last_name], email: params[:email],
                                                        uid: session[:cas_user])
    if !@user.valid?
      @user = User.find_by(uid: session[:cas_user])
    end
    if params[:class_select] != nil
      params[:class_select].each do |course|
        attrs = Utils.split_by_colon(course)
        if @user.user_courses.find_by(title: attrs[0]).nil?
          @user.user_courses.create(title: attrs[0], number: attrs[1], taken: true)

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1067193"]]
SELECT "user_courses".* FROM "user_courses" WHERE "user_courses"."user_id" = ?  [["user_id", 1]]
---
  def edit
    @user_classNames = []
    @user_takenClassNames = []
    @user.user_courses.each do |course|

DELETE FROM "user_courses" WHERE "user_courses"."id" = ?  [["id", 1]]
INSERT INTO "courses" ("course_number", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_number", "'CS70' + ': ' + 'Discrete Mathematics and Probability Theory'"], ["user_id", 24], ["created_at", "2016-03-02 04:28:49.136765"], ["updated_at", "2016-03-02 04:28:49.136765"]]
---
  def update
    @user.user_courses.destroy_all
    taken_classes = params[:taken_classes]
    puts params
    if params[:classes] != nil
      params[:classes].each_key do |course|
        attrs = Utils.split_by_colon(course)
        begin
          taken = taken_classes.include?(course)
        rescue
          taken = false
        end
        puts attrs[0]
        puts taken
        @user.user_courses.create(title: attrs[0], number: attrs[1], taken: taken)