app/controllers/application_controller.rb

  def welcome
    user_exists = User.find_by(uid: session[:cas_user]) != nil
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1067193"]]

  def index
    @user = User.find_by(uid: session[:cas_user])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1067193"]]

  def update
    @user = User.find_by(uid: session[:cas_user])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1067193"]]