app/controllers/login_controller.rb

  def index
    user_exists = User.find_by(uid: session[:cas_user]) != nil
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1067193"]]