app/views/application/index.html.haml

SELECT "user_courses".* FROM "user_courses" WHERE "user_courses"."user_id" = ?  [["user_id", 1]]
---
            %tbody
              - @user.courses.each do |course|